app/views/jobs/index.html.erb

SELECT 1 FROM "users" INNER JOIN "applications" ON "users"."id" = "applications"."user_id" WHERE "applications"."job_id" = 1 AND "users"."id" = 1 LIMIT 1
---
        <% if current_user %>
          <%= job.users.exists?(current_user) ? "Already applied" : link_to("Apply job", add_job_path(job.id), :method => :put) %>